app/controllers/api/v1/addbooks_controller.rb

SELECT `addbooks`.* FROM `addbooks`
---
  def index
    addbook = Addbook.all

INSERT INTO `addbooks` (`name`, `age`, `mob`, `gender`, `address`, `created_at`, `updated_at`) VALUES ('Pankaj', 25, '8623002395', 'M', 'Gondia', '2023-07-11 21:57:37.268999', '2023-07-11 21:57:37.268999')
---
  def create
    addbook = Addbook.create!(addbook_params)